vmux0.0.10-pre/ycsbVMs_ycsb_4vms_vmux-med_-1rps_rep0/vm3.log
/nix/store/2vwkssqpzykk37r996cafq7x63imf4sp-openjdk-21+35/bin/java  -classpath /nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/conf:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/core-0.17.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/HdrHistogram-2.1.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/htrace-core4-4.1.0-incubating.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-core-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-mapper-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/commons-pool2-2.4.2.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/jedis-2.9.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6381 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
Command line: -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6381 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
YCSB Client 0.17.0

Loading workload...
Starting test.
Maximum execution time specified as: 61 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-08-21 17:40:18:955 0 sec: 0 operations; est completion in 0 second 
2024-08-21 17:40:28:814 10 sec: 42572 operations; 4257.2 current ops/sec; est completion in 1 day 4 hours [READ: Count=21270, Max=14471, Min=107, Avg=227.23, 90=380, 99=454, 99.9=1133, 99.99=4911] [UPDATE: Count=21305, Max=25999, Min=103, Avg=226.36, 90=377, 99=463, 99.9=1990, 99.99=4855] 
2024-08-21 17:40:38:815 20 sec: 102968 operations; 6039.6 current ops/sec; est completion in 23 hours 10 minutes [READ: Count=30478, Max=9975, Min=103, Avg=165.65, 90=315, 99=366, 99.9=435, 99.99=3491] [UPDATE: Count=29915, Max=1985, Min=101, Avg=160.82, 90=310, 99=363, 99.9=425, 99.99=1766] 
2024-08-21 17:40:48:814 30 sec: 163528 operations; 6056 current ops/sec; est completion in 21 hours 52 minutes [READ: Count=30177, Max=1976, Min=100, Avg=165.63, 90=314, 99=384, 99.9=459, 99.99=723] [UPDATE: Count=30383, Max=10071, Min=92, Avg=161.61, 90=310, 99=377, 99.9=459, 99.99=1821] 
2024-08-21 17:40:58:814 40 sec: 210557 operations; 4702.9 current ops/sec; est completion in 22 hours 39 minutes [READ: Count=23464, Max=2016, Min=107, Avg=213.16, 90=380, 99=449, 99.9=523, 99.99=1852] [UPDATE: Count=23565, Max=4411, Min=102, Avg=208.99, 90=375, 99=445, 99.9=514, 99.99=1928] 
2024-08-21 17:41:08:814 50 sec: 268620 operations; 5806.3 current ops/sec; est completion in 22 hours 11 minutes [READ: Count=29052, Max=4911, Min=103, Avg=172.88, 90=321, 99=375, 99.9=472, 99.99=1769] [UPDATE: Count=29011, Max=6091, Min=102, Avg=168.47, 90=316, 99=370, 99.9=453, 99.99=1818] 
2024-08-21 17:41:18:814 60 sec: 326942 operations; 5832.2 current ops/sec; est completion in 21 hours 52 minutes [READ: Count=29211, Max=1807, Min=106, Avg=171.87, 90=321, 99=432, 99.9=507, 99.99=692] [UPDATE: Count=29111, Max=3663, Min=102, Avg=168, 90=316, 99=428, 99.9=502, 99.99=1750] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2024-08-21 17:41:19:826 61 sec: 333065 operations; 6050.4 current ops/sec; est completion in 21 hours 50 minutes [READ: Count=3047, Max=1773, Min=107, Avg=164.66, 90=310, 99=366, 99.9=387, 99.99=1773] [CLEANUP: Count=1, Max=1100, Min=1100, Avg=1100, 90=1100, 99=1100, 99.9=1100, 99.99=1100] [UPDATE: Count=3076, Max=2913, Min=101, Avg=162.32, 90=306, 99=355, 99.9=440, 99.99=2913] 
[OVERALL], RunTime(ms), 61016
[OVERALL], Throughput(ops/sec), 5458.650190114068
[TOTAL_GCS_Copy], Count, 31
[TOTAL_GC_TIME_Copy], Time(ms), 18
[TOTAL_GC_TIME_%_Copy], Time(%), 0.029500458896027273
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 31
[TOTAL_GC_TIME], Time(ms), 18
[TOTAL_GC_TIME_%], Time(%), 0.029500458896027273
[READ], Operations, 166699
[READ], AverageLatency(us), 182.5247661953581
[READ], MinLatency(us), 100
[READ], MaxLatency(us), 14471
[READ], 95thPercentileLatency(us), 367
[READ], 99thPercentileLatency(us), 426
[READ], Return=OK, 166699
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1100.0
[CLEANUP], MinLatency(us), 1100
[CLEANUP], MaxLatency(us), 1100
[CLEANUP], 95thPercentileLatency(us), 1100
[CLEANUP], 99thPercentileLatency(us), 1100
[UPDATE], Operations, 166366
[UPDATE], AverageLatency(us), 178.79888318526622
[UPDATE], MinLatency(us), 92
[UPDATE], MaxLatency(us), 25999
[UPDATE], 95thPercentileLatency(us), 363
[UPDATE], 99thPercentileLatency(us), 421
[UPDATE], Return=OK, 166366
AUTOTEST_DONE